create table films (
    id int auto_increment primary key,
    title varchar(100) not null,
    release_year int,
    director varchar(100),
    rating decimal(3, 1),
    genre varchar(30)
);

insert into films(title, release_year, director, rating, genre) values
('Побег из Шоушенка', 1994, 'Фрэнк Дарабонт', 9.3, 'Драма'),
('Темный рыцарь', 2008, 'Кристофер Нолан', 9.0, 'Фантастика'),
('Начало', 2010, 'Кристофер Нолан', 8.8, 'Фантастика'),
('Криминальное чтиво', 1994, 'Квентин Тарантино', 8.9, 'Криминал'),
('Интерстеллар', 2014, 'Кристофер Нолан', 8.7, 'Фантастика'),
('Властелин колец: Возвращение короля', 2003, 'Питер Джексон', 9.0, 'Фэнтези'),
('Матрица', 1999, 'Лана и Лилли Вачовски', 8.7, 'Фантастика'),
('Зеленая миля', 1999, 'Фрэнк Дарабонт', 8.6, 'Драма');

